{"title":"Laughing OnLine","description":"Lol, rofl, lmao, tehee, sksksk.","hed":"<span>l</span>aughing <span>o</span>n<br><span>l</span>ine","dek":"Exploring the usage, evolution, and perception of digital laughter.","series":"A four-part series on the usage, evolution, and perception of digital laughter.","parts":[{"slug":"share","index":"1","live":"true","title":"How the internet laughs","description":"It is 2019 and our laughter vocabulary has expanded. Let’s take a look at the current market share of laugh usage according to 700 million comments from Reddit from January through May, 2019.  <span class=note>Note: Our analysis only looks at text forms of laughter, excluding emojis.</span>"},{"slug":"lol","index":"2","release":"Tomorrow","title":"The evolution of <strong>lol</strong>","description":"Tk"},{"slug":"rank","index":"3","release":"Wednesday","title":"You rank it","description":"As with most lingo, the intent and perception of each laugh varies from person to person. Help us do some casual science to get a sense of how you use some of the most common laughs compared to other internet people."},{"slug":"review","index":"4","release":"Next week","title":"Perception in review","description":"Tk"}],"intro":[{"type":"text","value":"Laughter is complex. Even IRL <a href=https://www.zocalopublicsquare.org/2015/03/30/whats-the-difference-between-a-fake-hahaha-and-a-sincere-guffaw/ideas/nexus/ target=_blank>it is hard</a> to tell real ones and fake ones apart. Online, it is even harder with fewer visual cues and a wider range of tools to express laughter. As internet language develops, new forms of laughter spread like a cold in a classroom. <strong>This is the perception and evolution of the digital laugh</strong>."}],"share":{"tween":[{"type":"text","value":"Anyone who spends time on the internet should not be surprised by <strong>lol</strong>’s dominance. In her book <a href=https://www.penguinrandomhouse.com/books/540664/because-internet-by-gretchen-mcculloch/ target=_blank>Because Internet</a>, linguist Gretchen McCulloch explains that <q>...while <strong>lol</strong> started out indicating laughter, it quickly became aspirational, a way of showing your appreciation of a joke or defusing a slightly awkward situation even if you didn’t technically laugh at it.</q> When a term that literally means <strong>laughing out loud</strong> isn’t necessarily used for laughter anymore, it becomes increasingly difficult to keep track of a person’s intentions."},{"type":"text","value":"But the nuances of digital laughter run even deeper than just evolving meaning. Two other huge factors of its intended effect are length (e.g., <strong>ha</strong> vs. <strong>hahaha</strong>), and capitalization. McCulloch conducted a survey in 2017, she found that <q>the youngest group [of survey participants] flat-out rejected the idea of capitalizing <strong>lol</strong> or using it to indicate real laughter, even when expanded to <strong>LOLOLOL</strong>, and instead preferred the meanings of amusement, irony, and even passive aggression.</q> So many variables at play! In this next chart you can go deeper to see not only the market share of each laugh, but the ratio of lower to uppercase usage."}]},"rank":{"instructions1":"Pick a laugh. Not familiar? Skip it!","instructions2":"Tell us how funny something <em>really</em> is when you use","scale":[{"value":"1","text":"Unamused, not smiling; perhaps even feeling spiteful."},{"value":"2","text":"Neutral. Used as filler or to be nice. No physical response."},{"value":"3","text":"A single breath of air exits the mouth, a possible smile forms."},{"value":"4","text":"Visibly amused. Puffs of air released, slight body giration."},{"value":"5","text":"Laughing so much that breathing is hard; actually rofl-ing."}],"terms":["lol","ha","sksksk","i’m dead","i’m literally laughing","hahaha","LOL","rofl","looool","🤣","eks dee","ffffff"],"submit":"Submit","skip":"Just show me all results","another":"Pick another laugh"},"notes":[{"type":"text","value":"Questions or comments? sup@pudding.cool. This story was published in October 2019. Thanks to <a href=https://twitter.com/jadiehm target=_blank>Jan Diehm</a> for some design love."}],"method":[{"type":"text","value":"No emojis. No keyboard smash. No exclamation points."},{"type":"text","value":"Aggregated user survey data is updated live every 10 minutes."}]}