{"title":"Laughing OnLine","description":"Exploring the usage, evolution, and perception of digital laughter.","hed":"<span>l</span>aughing <span>o</span>n<br><span>l</span>ine","dek":"Exploring the usage, evolution, and perception of digital laughter.","series":"A four-part series on the usage, evolution, and perception of digital laughter.","parts":[{"slug":"share","index":"1","release":"&nbsp;","live":"live","title":"How the internet laughs","description":"It is 2019 and our laughter vocabulary has expanded. Let’s take a look at the current market share of laugh usage according to 700 million comments on Reddit from January to June, 2019.  <span class=note>Note: Our analysis only looks at text forms of laughter, excluding emojis. <a href=#method>See method</a>.</span>"},{"slug":"lol","index":"2","release":"Tomorrow","live":"live","title":"The evolution of lol","description":"Today, <strong>lol</strong> is prodigious. But has that always been the case? We went back 10 years (for reference: Obama’s first year in office) to find out. Here is the rise of <strong>lol</strong> in one chart."},{"slug":"rank","index":"3","release":"Thursday","title":"How funny is it?","description":"As with most lingo, the intent and perception of each laugh varies from person to person. Help us do some casual science to get a sense of how you use some of the most common laughs compared to other internet people."},{"slug":"review","index":"4","release":"Next week","title":"Perception in review","description":"Tk"}],"intro":[{"type":"text","value":"Laughter is complex. In real life <a href=https://www.zocalopublicsquare.org/2015/03/30/whats-the-difference-between-a-fake-hahaha-and-a-sincere-guffaw/ideas/nexus/ target=_blank>it can be hard</a> to tell the real from the fake. Online, it is even harder, with fewer visual cues and a wider range of tools to express laughter. As internet language develops, new forms of laughter spread like a cold in a classroom. This is a four-part series that takes a closer look at the usage, evolution, and perception of the digital laugh."}],"share":{"chartLowerTitle":"2019 usage share of laughs by category on Reddit","chartCaseTitle":"Usage share of laughs by category and lower/uppercase","lowerNote":"Many laugh labels represent a collection of variations of a laugh we discovered programmatically. For example, \"lool\" includes matches on multiple \"o\"s, or \"hahahahahaha\" represents any keyboard smashing of \"haha\".","tween":[{"type":"text","value":"Anyone who spends time on the internet should not be surprised by <strong>lol</strong>’s dominance. In her book <a href=https://www.penguinrandomhouse.com/books/540664/because-internet-by-gretchen-mcculloch/ target=_blank>Because Internet</a>, linguist Gretchen McCulloch explains that <q>...while <strong>lol</strong> started out indicating laughter, it quickly became aspirational, a way of showing your appreciation of a joke or defusing a slightly awkward situation even if you didn’t technically laugh at it.</q>"},{"type":"text","value":"When a term that literally means <strong>laughing out loud</strong> isn’t necessarily used for laughter anymore, it becomes difficult to parse its meaning."},{"type":"text","value":"But the nuances are more intricate than just meaning. Two other huge factors of the intended effect are length (e.g., <strong>ha</strong> vs. <strong>hahaha</strong>), and capitalization (e.g., <strong>lol</strong> vs. <strong>LOL</strong>). When McCulloch conducted a survey in 2017, she found that <q>the youngest group [of survey participants] flat-out rejected the idea of capitalizing <strong>lol</strong> or using it to indicate real laughter, even when expanded to <strong>LOLOLOL</strong>, and instead preferred the meanings of amusement, irony, and even passive aggression.</q>"},{"type":"text","value":"So many variables at play! In this next chart you can go deeper to see not only the market share of each laugh, but the ratio of lower to uppercase usage."}]},"lol":{"chartTitle":"Usage share of the top 20 laughs since 2009","tween":[{"type":"text","value":"<strong>Lol</strong> takes over because it is increasingly used for more than “laughing out loud.” According to McCulloch, it can soften confrontation, request sympathy, or add subtle layers of meaning. You might find it unfair to compare <strong>lol</strong> to “real” laughter. But as Mculloch points out, <q>in some ways, <strong>lol</strong> hasn’t changed its meaning so very far from its roots in laughter. Sure, sometimes we laugh at a direct joke, something we can point at and say, ‘That’s funny.’ But there’s also nervous laughter, social laughter, and polite smiles.</q>"},{"type":"text","value":"By this framing, <strong>lol</strong>’s transformation is less like a shift, and more like an evolution. Squirtle became Blastoise. A butter knife became a Swiss Army knife. Dancing 90’s J Lo became triple-threat J Lo? J Lol."}]},"rank":{"instructions1":"Pick a laugh. Not familiar? Skip it!","instructions2":"Tell us how funny something <em>really</em> is when you use","scale":[{"value":"1","text":"Unamused, not smiling; perhaps even feeling spiteful."},{"value":"2","text":"Neutral. Used as filler or to be nice. No physical response."},{"value":"3","text":"A single breath of air exits the mouth, a possible smile forms."},{"value":"4","text":"Visibly amused. Puffs of air released, slight body giration."},{"value":"5","text":"Laughing so much that breathing is hard; actually rofl-ing."}],"terms":["lol","ha","sksksk","i’m dead","i’m literally laughing","hahaha","LOL","rofl","looool","🤣","eks dee","ffffff"],"submit":"Submit","skip":"Just show me all results","another":"Pick another laugh"},"more":"That’s it for today. But wait...there’s more!","notes":[{"type":"text","value":"This story was published in October 2019. Questions or comments? sup@pudding.cool."}],"method":[{"type":"text","value":"We used BigQuery to process every Reddit comment since 2009. Sadly this does not include emojis which are certainly a big player in today’s laugh arsenal. This isn’t a comprehensive survey of laughs, but darn close. We analyzed way more laughs than displayed but only include results with 0.01% or greater share of laughs. We didn’t include true keyboard smashing, but accounted for laughter misspellings with some handy regex patterns. We also ignored all punctuation so we didn’t examine exclamation points as a laugh enhancer."}]}